# GetEdgeReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnEdge..::..GetEdgeReference Method
PointOnEdge Class See Also
---
Get a copy of the edge or curve reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference GetEdgeReference()
```

Visual Basic
---
```text
Public Function GetEdgeReference As Reference
```

Visual C++
---
```text
public:
Reference^ GetEdgeReference()
```

# See Also
PointOnEdge Class
Autodesk.Revit.DB Namespace